<!--Esto falta por cambiarlo entero que es el resumen de la practica del a&ntilde;o pasado-->



<!DOCTYPE html>
<html lang="es">
<head>
	<meta charset="UTF-8">
	<title>Info</title>
	<link rel="stylesheet" href="estilo.css">
	<link rel="stylesheet" href="fontello/css/fontello.css">
	<link rel="stylesheet" href="fontello/css/animation.css">
	<link href="https://fonts.googleapis.com/css?family=Amatic+SC%7CAmatica+SC%7CBevan%7CCrushed%7COpen+Sans+Condensed:300%7COswald%7CVesper+Libre" rel="stylesheet">
	<meta name="viewport" content="width=device-width, initial-scale=1" />
</head>
<body>
	<header id="top">
		<div class="inside">
			<a href="index.html"> <h1> 日本 <br> Recetas Tradicionales Japonesas</h1></a>	
			<ul class="boton">
					<li><a href="registro.html"><i class="icon-user-1"></i> REG&Iacute;STRATE</a></li>
					<li><a href="login.html"><i class="icon-login"></i> Login</a></li>
					<li><a href="index.html"><i class="icon-logout"></i> Logout</a></li>
			</ul>
			<div id="busqueda">
				<input id="buscador" type="text" placeholder="¿Qu&eacute; receta buscas? :)"><a href="buscar.html"><i class="icon-search"></i></a>
			</div> 
			<nav>
				<ul>
					<li><a href="index.html"><span class="icon-home"></span>Inicio</a></li>
					<li><a href="buscar.html"><span class="icon-search-1"></span>Buscar receta</a></li>
					<li><a href="nueva-receta.html"><span class="icon-doc-text"></span>Nueva receta</a></li>
				</ul>
			</nav>
		</div>
	</header>
	<div id="documentacion">
	<h2>Documentaci&oacute;n de la web</h2>
		<p><strong>Autores:</strong> Marta Tirado Asencio y Gonzalo Garc&iacute;a Campos.</p>
		<p><strong>DNI:</strong> 48791170M - 48671874X</p>
		<p><strong>Grupo de pr&aacute;cticas:</strong> Viernes de 9:00 a 11:00 y Jueves de 13:00 a 15:00</p>

	<h2>Partes de la pr&aacute;ctica realizadas</h2>
		<p> Para ver las partes de la pr&aacute;ctica que hemos realizado nos vamos a basar en el enunciado de la misma.</p>
		<p> Hemos implementado todas las p&aacute;ginas.html que pedian usando HTML5, le hemos pasado el validador, y en un principio nos han dado bastante errores, pero hemos conseguido solucionar m&aacute;s de la mitad, los que quedan actualmente son con algunos enlaces, con las fuentes de google y con alg&uacute;n textarea, y no sabemos como solucionarlos por el momento, a&uacute;n que seguiremos intentandolo.</p>


		<p> Sobre el pie de p&aacute;gina, hemos incluido muchas cosas, el nombre de la web, la peque&ntilde;a descripci&oacute;n, un enlace a todos nuetsros datos, otro a la breve descripci&oacute;n de qu&eacute; y para qu&eacute; es esta web, la informaci&oacute;n que es el enlace a esta documetaci&oacute;n, y un aviso legal y pol&iacute;tica de privacidad como complemento. Tambi&eacute; est&aacute; el detalle del copyright y la fecha de creaci&oacute;n. Los datos como la informaci&oacute;n de contacto est&aacute; en "cont&aacute;ctanos" ya que si lo pon&iacute;a en el pie de p&aacute;gina era sobrecargarlo en exceso.</p>

		<p>En los formularios se cumple el hecho de destacar el campo que recibe el foco.</p>

		<p>Tambi&eacute;n uso Web Fonts e Icon Fonts. He realizado el dise&ntilde;o responsive con la t&eacute;cnica de Mobile First. Y hemos usado las reglas media query. Por debajo de los 480px, hemos implementado el men&uacute; de hamburguesa, a&uacute;n que &uacute;nicamente con el Inicio, el Buscar Art&iacute;culo y el Nuevo Art&iacute;culo, ya que lo ve&iacute;a m&aacute;s visual.</p>
		<br>
		<p>En el index.html, est&aacute;n las 6 entradas, con su respectiva informaci&oacute;n. He considerado cambiar un poco la extructura ya que, conseguimos unas animaciones que me parecieron muy interesantes y nos apetec&iacute;a implementarlas, por lo tanto la informaci&oacute;n de cada art&iacute;culo se encuentra oculta detr&aacute;s de la imagen y si pasas por encima se da la vuelta y la muestra. Por lo tanto, esta animaci&oacute;n se "solapaba" con la de que aparecier&aacute; el texto descriptivo.</p>
		
		<p>Hemos dejado implementado los 10 comentarios que ped&iacute;as el a&ntilde;o pasado y que mediante css se corte mostrando puntos suspensivos. Tambi&eacute;n te env&iacute;a a la parte de comentarios si clickas en uno de ellos</p>
		<p>Tanto en registro como en el login.html he conseguido realizar todo.</p>
		<p>En el buscar.html y receta.html est&aacute; todo implementado.</p>
		<p>En nueva-receta.html tambi&eacute;n est&aacute; todo implementado.</p>
		<p>Y por &uacute;ltimo, en acerca.html se encuentra casi todo lo pedido, lo que no se encuentre en esa p&aacute;gina estar&aacute; en nosotros.html</p>

		<p>Por otra parte tambi&eacute;n quer&iacute;a destacar el uso de "&_acute;", lo he utilizado cuanto he podido, pero en texto muy grandes lo he obviado por falta de tiempo, para la pr&oacute;xima pr&aacute;ctica estar&aacute;n.</p>

	<h2>Imcompatibilidades y problemas</h2>
		<p>No he tenido tiempo de descargar y probar la pr&aacute;ctica en otro navegadores, yo la he realizado en Google Chrome.</p>

	</div>

	<footer>
		<div class="foot">
			<div>
				<h4>日本 </h4> Recetas Tradicionales Japonesas.				
			</div>
			<nav>
				<ul>
					<li><a href="contacto.html">Cont&aacute;ctanos</a></li>
					<li><a href="acerca.html">Qui&eacute;nes somos</a></li>
					<li><a href="info.html">+Info</a></li>
				</ul>
			</nav>
			<nav id="legal">
				<ul>
					<li><a href="legal.html">Aviso legal</a></li>
					<li><a href="privacidad.html">pol&iacute;tica de privacidad</a></li>
				</ul>
			</nav>
			<p>&copy; <strong>Recetas Tradicionales Japonesas - </strong> <time datetime="2018-02">Febrero de 2018</time></p>
		</div>
	</footer>
</body>

